{"modelTopology":{"class_name":"Sequential","config":{"name":"trump-sentiment","layers":[{"class_name":"Dense","config":{"units":100,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.04278056057379068,"noise_shape":null,"seed":null,"name":"dropout_Dropout15","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true}},{"class_name":"Dropout","config":{"rate":0.04278056057379068,"noise_shape":null,"seed":null,"name":"dropout_Dropout16","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"softsign","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true}},{"class_name":"Dropout","config":{"rate":0.04278056057379068,"noise_shape":null,"seed":null,"name":"dropout_Dropout17","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense36","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./trump-sentiment.weights.bin"],"weights":[{"name":"dense_Dense33/kernel","shape":[512,100],"dtype":"float32"},{"name":"dense_Dense33/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense34/kernel","shape":[100,50],"dtype":"float32"},{"name":"dense_Dense34/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense35/kernel","shape":[50,1],"dtype":"float32"},{"name":"dense_Dense35/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense36/kernel","shape":[1,3],"dtype":"float32"}]}]}